app/Controllers/Data.php

    public function index(): string
    {
        $session = session();

        $data = array(
                'data' => $this->dataModel->findAll(),
                'pager' => $this->dataModel->pager
            );
---
SELECT *
FROM `data`

    public function save($id)
    {
        //load helper form and URL
        helper(['form', 'url']);
        $dataModel = new data_model();
        // $id = $this->uri->getSegment(3);

        //insert data into database
        $dataModel->update($id, [
            'R101'   => 'Lampung',
            'R102'   => 'Pringsewu',
            'R103'   => $this->request->getPost('R103'),
            'R104' => $this->request->getPost('R104'),
            'R106A' => $this->request->getPost('R106A')
        ]);
---
UPDATE `data` SET `R101` = 'Lampung', `R102` = 'Pringsewu', `R103` = '1810010', `R104` = '1810030011', `R106A` = '1'
WHERE `data`.`id` IN ('')