app/Controllers/Data.php

    public function detail($id)
    {
        $request = $this->request;
        $id = $request->getUri()->getSegment(3);
        // model initialize
        $dataModel = new data_model();

        $data = array(
            'data' => $dataModel->find($id),
            'kecamatan' => $this->kecamatanModel->findAll(),
            'desa' => $this->desaModel->findAll(),
            'sls' => $this->slsModel->getSlsByDesaId($id),
            'ques' => $this->quesModel->findAll()
        );
---
SELECT *
FROM `data`
WHERE `data`.`data_id` = '9'
SELECT *
FROM `desa`
SELECT *
FROM `ques`

    public function detail3($id)
    {
        $request = $this->request;
        $id = $request->getUri()->getSegment(3);
        // model initialize
        $dataModel = new data_model();

        $data = array(
            'data' => $dataModel->find($id),
            'kecamatan' => $this->kecamatanModel->findAll(),
            'desa' => $this->desaModel->findAll(),
            'sls' => $this->slsModel->getSlsByDesaId($id),
            'ques' => $this->quesModel->findAll()
        );
---
SELECT *
FROM `ques`
SELECT *
FROM `desa`
SELECT *
FROM `data`
WHERE `data`.`data_id` = '1'

    public function detail4($id)
    {
        $request = $this->request;
        $id = $request->getUri()->getSegment(3);
        // model initialize
        $dataModel = new data_model();

        $data = array(
            'data' => $dataModel->find($id),
            'kecamatan' => $this->kecamatanModel->findAll(),
            'desa' => $this->desaModel->findAll(),
            'sls' => $this->slsModel->getSlsByDesaId($id),
            'ques' => $this->quesModel->findAll()
        );
---
SELECT *
FROM `ques`
SELECT *
FROM `data`
WHERE `data`.`data_id` = '1'
SELECT *
FROM `desa`

    public function detail5($id)
    {
        $request = $this->request;
        $data_id = $request->getUri()->getSegment(3);
        // model initialize
        $data1Model = new data_model();
        $data2Model = new data2_model();

        $joinedData = $data1Model->getJoinedData($data_id);

        // Error handling if no data is found
        if (!$joinedData) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Data not found for ID ' . $data_id);
        }

        // Prepare the data array for the view
        $data = [
            'data' => $joinedData,
            'kecamatan' => $this->kecamatanModel->findAll(),
            'desa' => $this->desaModel->findAll(),
            'ques' => $this->quesModel->findAll()
---
SELECT *
FROM `desa`
SELECT *
FROM `ques`

    public function detail6($id)
    {
        $request = $this->request;
        $data_id = $request->getUri()->getSegment(3);
        // model initialize
        $data1Model = new data_model();
        $data2Model = new data2_model();

        $joinedData = $data1Model->getJoinedData($data_id);

        // Error handling if no data is found
        if (!$joinedData) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Data not found for ID ' . $data_id);
        }

        // Prepare the data array for the view
        $data = [
            'data' => $joinedData,
            'kecamatan' => $this->kecamatanModel->findAll(),
            'desa' => $this->desaModel->findAll(),
            'ques' => $this->quesModel->findAll()
        ];
---
SELECT *
FROM `data`
WHERE `data`.`data_id` = '1'
SELECT *
FROM `ques`
SELECT *
FROM `desa`

    public function detail9($id)
    {
        $request = $this->request;
        $data_id = $request->getUri()->getSegment(3);
        // model initialize
        $data1Model = new data_model();
        $data2Model = new data2_model();

        $joinedData = $data1Model->getJoinedData($data_id);

        // Error handling if no data is found
        if (!$joinedData) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Data not found for ID ' . $data_id);
        }

        // Prepare the data array for the view
        $data = [
            'data' => $joinedData,
            'kecamatan' => $this->kecamatanModel->findAll(),
            'desa' => $this->desaModel->findAll(),
            'ques' => $this->quesModel->findAll()
        ];
---
SELECT *
FROM `data`
WHERE `data`.`data_id` = '9'
SELECT *
FROM `desa`
SELECT *
FROM `ques`

    public function detail10($id)
    {
        $request = $this->request;
        $data_id = $request->getUri()->getSegment(3);
        // model initialize
        $data1Model = new data_model();
        $data2Model = new data2_model();

        $joinedData = $data1Model->getJoinedData($data_id);

        // Error handling if no data is found
        if (!$joinedData) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Data not found for ID ' . $data_id);
        }

        // Prepare the data array for the view
        $data = [
            'data' => $joinedData,
            'kecamatan' => $this->kecamatanModel->findAll(),
            'desa' => $this->desaModel->findAll(),
            'ques' => $this->quesModel->findAll()
---
SELECT *
FROM `desa`
SELECT *
FROM `ques`

    public function create3($data_id)
    {
        // model initialize
        $dataModel = new data_model();

        $data = array(
            'data' => $dataModel->find($data_id),
            'kecamatan' => $this->kecamatanModel->findAll(),
            'desa' => $this->desaModel->findAll(),
            'ques' => $this->quesModel->findAll()
        );
---
SELECT *
FROM `data`
WHERE `data`.`data_id` = '66d67400a6c509.21204427'
SELECT *
FROM `desa`
SELECT *
FROM `ques`

    public function create5($data_id)
    {
        // model initialize
        $data1Model = new data_model();
        $data2Model = new data2_model();

        $joinedData = $data1Model->getJoinedData($data_id);

        // Error handling if no data is found
        if (!$joinedData) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Data not found for ID ' . $data_id);
        }

        // Prepare the data array for the view
        $data = [
            'data' => $joinedData,
            'kecamatan' => $this->kecamatanModel->findAll(),
            'desa' => $this->desaModel->findAll(),
            'ques' => $this->quesModel->findAll()
---
SELECT *
FROM `desa`
SELECT *
FROM `ques`

    public function edit3()
    {
        $request = $this->request;
        $id = $request->getUri()->getSegment(3);
        // model initialize
        $dataModel = new data_model();

        $data = array(
            'data' => $dataModel->find($id),
            'ques' => $this->quesModel->findAll()
        );
---
SELECT *
FROM `data`
WHERE `data`.`data_id` = '66d67400a6c509.21204427'
SELECT *
FROM `ques`