app/Controllers/Home.php

SELECT *
FROM `desa`
---
            'getcalonpilkadesbypekon'       => $getcalonpilkadesbypekon,
            'getsuarapilkadesbypekon'       => $getsuarapilkadesbypekon,
            'getaparaturbypekon'            => $getaparaturbypekon,
            'desa' => $desaModel->findAll(),
        );