app/Controllers/Home.php

            'getsarkesbypekon'       => $getsarkesbypekon,
            'getsarpendbypekon'       => $getsarpendbypekon,
            'getmasjidbypekon'      => $getmasjidbypekon,
            'getsuraubypekon'       => $getsuraubypekon,
            'getkristenbypekon'       => $getkristenbypekon,
            'getkatolikbypekon'       => $getkatolikbypekon,
            'getkapelbypekon'       => $getkapelbypekon,
            'getpurabypekon'       => $getpurabypekon,
            'getwiharabypekon'        => $getwiharabypekon,
            'getkelentengbypekon'        => $getkelentengbypekon,
            'getbasarahbypekon'       => $getbasarahbypekon,
            'getlainnyabypekon'       => $getlainnyabypekon,
            'getbankbypekon'       => $getbankbypekon,
            'getkoperasibypekon'       => $getkoperasibypekon,
            'getsarpekbypekon'       => $getsarpekbypekon,
            'getsarprasebypekon'       => $getsarprasebypekon,
            'getolahragabypekon'        => $getolahragabypekon,
            'gethansipbypekon'       => $gethansipbypekon,
            'getpolisibypekon'       => $getpolisibypekon,
            'getthpilkadesbypekon'       => $getthpilkadesbypekon,
            'getcalonpilkadesbypekon'       => $getcalonpilkadesbypekon,
            'getsuarapilkadesbypekon'       => $getsuarapilkadesbypekon,
            'desa' => $desaModel->findAll(),
        );
---
SELECT *
FROM `desa`