app/Controllers/User.php

INSERT INTO `users` (`user_username`, `user_name`, `user_email`, `user_password`, `user_role`) VALUES (NULL, NULL, NULL, '$2y$10$/bagIdRlpSvZ3R6i/LeJIuVD11JXHHE3JXbL38W5abuACf92XUX2W', NULL)
---
            // $userModel->protect(false);

            //insert data into database
            $userModel->insert([
                'user_username'   => $this->request->getPost('username'),
                'user_name' => $this->request->getPost('name'),
                'user_email' => $this->request->getPost('email'),
                'user_password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
                'user_role' => $this->request->getPost('role')
            ]);