app/Models/data_model.php

SELECT *
FROM `data` `dt`
JOIN `desa` `ds` ON `ds`.`kode_desa` = `dt`.`R104`
JOIN `kec` `k` ON `k`.`kode_kec` = `dt`.`R103`
---
   function getAll(){
      $builder = $this->db->table('data dt');
      $builder->join('desa ds', 'ds.kode_desa = dt.R104');
      $builder->join('kec k', 'k.kode_kec = dt.R103');
      // $builder->join('sls s','s.data_id = dt.data_id');
      $query = $builder->get();