app/Models/data_model.php

SELECT `data`.*, `data2`.*
FROM `data`
JOIN `data2` ON `data2`.`data_id` = `data`.`data_id`
WHERE `data`.`data_id` = '66d12868bfc898.87417271'
 LIMIT 1
---
   public function getJoinedData($data_id)
   {
      return $this->select('data.*, data2.*')
                  ->join('data2', 'data2.data_id = data.data_id')
                  ->where('data.data_id', $data_id)
                  ->first(); // Or use find() if you expect multiple rows

SELECT *
FROM `data` `dt`
JOIN `desa` `ds` ON `ds`.`kode_desa` = `dt`.`R104`
JOIN `kec` `k` ON `k`.`kode_kec` = `dt`.`R103`
---
   public function getAll()
   {
      $builder = $this->db->table('data dt');
      $builder->join('desa ds', 'ds.kode_desa = dt.R104');
      $builder->join('kec k', 'k.kode_kec = dt.R103');
      $query = $builder->get();

SELECT *
FROM `data` `dt`
JOIN `desa` `ds` ON `ds`.`kode_desa` = `dt`.`R104`
JOIN `kec` `k` ON `k`.`kode_kec` = `dt`.`R103`
WHERE `ds`.`kode_desa` = '1810030011'
---
   public function getDataByDesa($desa_id)
   {
      $builder = $this->db->table('data dt');
      $builder->join('desa ds', 'ds.kode_desa = dt.R104');
      $builder->join('kec k', 'k.kode_kec = dt.R103');
      $builder->where('ds.kode_desa', $desa_id);
      $query = $builder->get();