app/Models/desa_model.php

   public function getDesaByUserId($user_id)
   {
       return $this->db->table('desa')
                       ->select('desa.kode_desa, desa.desa')
                       ->join('users', 'desa.kode_desa = users.desa')
                       ->where('users.user_id', $user_id)
                       ->get()
                       ->getResultArray();
---
SELECT `desa`.`kode_desa`, `desa`.`desa`
FROM `desa`
JOIN `users` ON `desa`.`kode_desa` = `users`.`desa`
WHERE `users`.`user_id` = '2'