app/Models/user_model.php

   function getAll(){
      $builder = $this->db->table('users u');
      $builder->join('desa ds', 'ds.kode_desa = u.desa');
      $query = $builder->get();
---
SELECT *
FROM `users` `u`
JOIN `desa` `ds` ON `ds`.`kode_desa` = `u`.`desa`

   public function getRole($user_id)
   {
      return $this->where('user_id', $user_id)->first();
---
SELECT *
FROM `users`
WHERE `user_id` = '2'
 LIMIT 1